app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'zabania'
 LIMIT 1
---
		    public function login()
		    {
		        if ($this->request->getPost('username')!=0) {
		            $username = $this->request->getVar('username');
		            $password = $this->request->getVar('password');
					$is_aktif = $this->request->getVar('is_aktif');

					$dataUser = $this->user->where(['username' => $username])->first();